app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "genre", "realise", "rating", "descripton", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)